#text = input("Введите текст: ")
#b = text.count(" ")
#print("Количество пробелов:" , b)

#s = input("Введите предложение: ")
#print(s.replace(" ", "_"))

#a = []
#n = int(input("Сколько элементов вы хотите добавить список! "))
#for i in range(n):
    #iten = input(f"Введите {n} чисел")

#numbers = [1, 2, 3, 4, 5]

#def square(number): return number * number


#result = map(square, numbers)

#for n in result: print(n, end=" ")  # 1 4 9 16 25

#numbers = [-5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5]


#def condition(number): return number > 1


#result = filter(condition, numbers)

#for n in result: print(n, end=" ")  # 2 3 4 5

#a = []
#n = int(input("Сколько чисел вы хотели добавить в cписок?" ))
#for i in range(n):
    #nou = float(input(f"Введите число {i+1}: "))
    #a.append(nou)
#print("Ваш список: ", a)
#p = sum(a) / len(a)
#print("Среднее арифметическое: ", p)




